In [114]:
# importing all the dependent packages

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

In [115]:
from zipfile import ZipFile


file_name = 'titanic.zip'

with ZipFile(file_name, 'r') as zip:
    # printing out the content of the zip filee
    zip.printdir()
    # extracting the file
    zip.extractall()

File Name                                             Modified             Size
gender_submission.csv                          2019-12-11 02:17:12         3258
test.csv                                       2019-12-11 02:17:12        28629
train.csv                                      2019-12-11 02:17:12        61194

In [116]:
train = pd.read_csv('train.csv')
test= pd.read_csv('test.csv')

In [117]:
train.shape,test.shape

((891, 12), (418, 11))

In [118]:
train.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [119]:
test.isna().sum(0)

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [120]:
# concat the dataframe

a = lambda a,b: pd.concat([a,b])

In [121]:
train_ = train.copy()
test_ = test.copy()

In [122]:
df = a(train_,test_)

In [123]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [124]:
df.shape

(1309, 12)

In [125]:
df.drop(['PassengerId','Survived'],axis =1, inplace=True)

In [126]:
df.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [127]:
sex= {
    'male':0,
    'female': 1
}

In [128]:
df.Sex = df.Sex.map(sex)

In [129]:
df.Sex.value_counts()

0    843
1    466
Name: Sex, dtype: int64

In [130]:
def handling_missing(df, thresh, confirm= None):
    holder = {}
    for col in df.columns:
        rate = (df[col].isna().sum()/df.shape[0]) *100
        if rate >= thresh:
            holder[col] = rate

    if confirm == True:
        df.drop([i for i in holder], axis =1,inplace= True)
        return df
    else:
        print(f'the missing values are than the treshhold value')
        return holder

In [131]:
handling_missing(df,70)

df=handling_missing(df,70,True)

the missing values are than the treshhold value

In [132]:
df.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,S
1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C
2,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,S
3,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,S
4,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,S

In [133]:
df.isna().sum()

Pclass        0
Name          0
Sex           0
Age         263
SibSp         0
Parch         0
Ticket        0
Fare          1
Embarked      2
dtype: int64

## Statistical Imputation

In [134]:
df.dtypes

Pclass        int64
Name         object
Sex           int64
Age         float64
SibSp         int64
Parch         int64
Ticket       object
Fare        float64
Embarked     object
dtype: object

In [135]:
df.Embarked.unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [136]:
from sklearn.impute import SimpleImputer
from sklearn.preprocessing import OneHotEncoder

In [137]:
df['Embarked'].fillna(df.Embarked.mode, inplace=True)

In [138]:
df.Embarked.isna().value_counts()

False    1309
Name: Embarked, dtype: int64

In [139]:
 df_ = df.copy()

 df_.drop(['Name','Embarked','Ticket'],axis = 1, inplace=True)

In [140]:
imputer = SimpleImputer(strategy='mean')

cols = df_.columns

df_ = imputer.fit_transform(df_)

# convert back to a dataframe


df_ = pd.DataFrame(df_,columns=cols)

In [141]:
df_.isna().value_counts()

Pclass  Sex    Age    SibSp  Parch  Fare
False   False  False  False  False  False    1309
dtype: int64

In [142]:
cat = ['Name','Embarked']

x = df.Embarked
y = df.Name

In [143]:
df_['Name'] =df['Name'].values
df_['Embarked'] = df['Embarked'].values

In [144]:
df_

,Pclass,Sex,Age,SibSp,Parch,Fare,Name,Embarked
0,3.0,0.0,22.000000,1.0,0.0,7.2500,"Braund, Mr. Owen Harris",S
1,1.0,1.0,38.000000,1.0,0.0,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",C
2,3.0,1.0,26.000000,0.0,0.0,7.9250,"Heikkinen, Miss. Laina",S
3,1.0,1.0,35.000000,1.0,0.0,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",S
4,3.0,0.0,35.000000,0.0,0.0,8.0500,"Allen, Mr. William Henry",S
...,...,...,...,...,...,...,...,...
1304,3.0,0.0,29.881138,0.0,0.0,8.0500,"Spector, Mr. Woolf",S
1305,1.0,1.0,39.000000,0.0,0.0,108.9000,"Oliva y Ocana, Dona. Fermina",C
1306,3.0,0.0,38.500000,0.0,0.0,7.2500,"Saether, Mr. Simon Sivertsen",S
1307,3.0,0.0,29.881138,0.0,0.0,8.0500,"Ware, Mr. Frederick",S
1308,3.0,0.0,29.881138,1.0,1.0,22.3583,"Peter, Master. Michael J",C

In [154]:
sex_d = pd.get_dummies(df_.Sex,prefix='Sex', drop_first=True)
em_d=pd.get_dummies(df_.Embarked, drop_first=True)

In [155]:
sex_d

      Sex_1.0
0           0
1           1
2           1
3           1
4           0
...       ...
1304        0
1305        1
1306        0
1307        0
1308        0

[1309 rows x 1 columns]

In [159]:

df_=pd.concat([df_,em_d],axis=1)

In [160]:
df_=pd.concat([df_,sex_d],axis=1)

In [161]:
df_

,Pclass,Sex,Age,SibSp,Parch,Fare,Name,Embarked,C,Q,S,Sex_1.0
0,3.0,0.0,22.000000,1.0,0.0,7.2500,"Braund, Mr. Owen Harris",S,0,0,1,0
1,1.0,1.0,38.000000,1.0,0.0,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",C,1,0,0,1
2,3.0,1.0,26.000000,0.0,0.0,7.9250,"Heikkinen, Miss. Laina",S,0,0,1,1
3,1.0,1.0,35.000000,1.0,0.0,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",S,0,0,1,1
4,3.0,0.0,35.000000,0.0,0.0,8.0500,"Allen, Mr. William Henry",S,0,0,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3.0,0.0,29.881138,0.0,0.0,8.0500,"Spector, Mr. Woolf",S,0,0,1,0
1305,1.0,1.0,39.000000,0.0,0.0,108.9000,"Oliva y Ocana, Dona. Fermina",C,1,0,0,1
1306,3.0,0.0,38.500000,0.0,0.0,7.2500,"Saether, Mr. Simon Sivertsen",S,0,0,1,0
1307,3.0,0.0,29.881138,0.0,0.0,8.0500,"Ware, Mr. Frederick",S,0,0,1,0
1308,3.0,0.0,29.881138,1.0,1.0,22.3583,"Peter, Master. Michael J",C,1,0,0,0

In [164]:
df_.drop(['Sex','Embarked'],axis=1,inplace=True)

In [165]:
df_

,Pclass,Age,SibSp,Parch,Fare,Name,C,Q,S,Sex_1.0
0,3.0,22.000000,1.0,0.0,7.2500,"Braund, Mr. Owen Harris",0,0,1,0
1,1.0,38.000000,1.0,0.0,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,0,0,1
2,3.0,26.000000,0.0,0.0,7.9250,"Heikkinen, Miss. Laina",0,0,1,1
3,1.0,35.000000,1.0,0.0,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,0,1,1
4,3.0,35.000000,0.0,0.0,8.0500,"Allen, Mr. William Henry",0,0,1,0
...,...,...,...,...,...,...,...,...,...,...
1304,3.0,29.881138,0.0,0.0,8.0500,"Spector, Mr. Woolf",0,0,1,0
1305,1.0,39.000000,0.0,0.0,108.9000,"Oliva y Ocana, Dona. Fermina",1,0,0,1
1306,3.0,38.500000,0.0,0.0,7.2500,"Saether, Mr. Simon Sivertsen",0,0,1,0
1307,3.0,29.881138,0.0,0.0,8.0500,"Ware, Mr. Frederick",0,0,1,0
1308,3.0,29.881138,1.0,1.0,22.3583,"Peter, Master. Michael J",1,0,0,0

# training data without comprehensive feature engineering

In [166]:
from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestClassifier

In [184]:
def seperator(df, shape):
    trainer = df.iloc(shape)
    tester = df.iloc(shape)

    return trainer, tester

In [179]:
seperator = train.shape[0]
trainer,tester =sep(df_,seperator)

ValueError: No axis named 891 for object type DataFrame

In [177]:
df_.shape

(1309, 10)

891